<?php
return array(

    'API_ERROR_CODE' => [
        '200' => 'OK',


        '1000' => '令牌不存在',
        '1001' => '令牌不合法或者已经失效',
        '1002' => '令牌设置失败',
        '1003' => '令牌不是当前UID用户所有',
        '1004' => '缺少Code编号',
        '1005' => '缺少用户参数UID',
        '1006' => '缺少参数status',
        '1007' => '缺少参数或者频道id不正确',
        '1008' => '缺少参数',
        '1009' => '缺少openid',

        '1100' => '暂无数据',


        /* 用户基本操作 */
        '10000' => '手机号码格式错误',
        '10001' => '密码不能为空',
        '10002' => '注册失败',
        '10003' => '手机号还未注册',
        '10004' => '用户已经存在',
        '10005' => '密码错误',
        '10006' => '该用户已被禁用',
        '10007' => '密码修改失败',
        '10008' => '新密码不能与旧密码一样',
        '10009' => '密码要求8~16位英文或数字',
        '10010' => '用户名或密码错误',
        '10011' => '数据错误',
        '10012' => '邮箱已经存在',
        '10013' => '编辑用户数据错误',
        '10014' => '编辑用户失败',
        '10015' => '昵称要在15字以内',
        '10016' => '反馈问题在200字以内',
        '10017' => '意见反馈失败',
        '10018' => '用户不存在',
        '10019' => '手机号已注册',
        '10020' => '存在派单记录不可删除',
        '10021' => '删除失败',
        '10022' => '编辑用户头像失败',
        '10023' => '状态更改失败',
        '10024' => '状态更改成功',
        '10025' => '不能邀请自己',
        '10026' => '该用户已经邀请过',
        '10027' => '旧密码错误',


        '10501' => '自定义错误', //为$message指定错误内容

        /********二维码分享返回信息************/
        '14000' => '生成二维码失败',


        /********上传图片返回信息************/
        '20000' => '上传内容为空',
        '20001' => '上传失败',



        /********发送短信返回信息************/
        '110000' => '短信发送太频繁，请稍后再试',
        '110001' => '发送失败',
        '110002' => '验证码不匹配',

    ],
);