<?php
return array(

    'API_ERROR_CODE' => [
        '200' => 'OK',


        '1000' => '令牌不存在',
        '1001' => '令牌不合法或者已经失效',
        '1002' => '令牌设置失败',
        '1003' => '令牌不是当前UID用户所有',
        '1004' => '缺少Code编号',
        '1005' => '缺少用户参数UID',
        '1006' => '缺少参数status',
        '1007' => '缺少参数或者频道id不正确',
        '1008' => '缺少参数',
        '1009' => '缺少openid',

        '1100' => '暂无数据',


        /* 用户基本操作 */
        '10000' => '手机号码格式错误',
        '10001' => '密码不能为空',
        '10002' => '注册失败',
        '10003' => '手机号还未注册',
        '10004' => '用户已经存在',
        '10005' => '密码错误',
        '10006' => '该用户已被禁用',
        '10007' => '密码修改失败',
        '10008' => '新密码不能与旧密码一样',
        '10009' => '密码要求8~16位英文或数字',
        '10010' => '用户名或密码错误',
        '10011' => '数据错误',
        '10012' => '邮箱已经存在',
        '10013' => '编辑用户数据错误',
        '10014' => '编辑用户失败',
        '10015' => '昵称要在15字以内',
        '10016' => '反馈问题在200字以内',
        '10017' => '意见反馈失败',
        '10018' => '用户不存在',
        '10019' => '手机号已注册',
        '10020' => '存在派单记录不可删除',
        '10021' => '删除失败',
        '10022' => '编辑用户头像失败',
        '10023' => '状态更改失败',
        '10024' => '状态更改成功',
        '10025' => '不能邀请自己',
        '10026' => '该用户已经邀请过',
        '10027' => '旧密码错误',


        '10501' => '自定义错误', //为$message指定错误内容

        /********二维码分享返回信息************/
        '14000' => '生成二维码失败',
        '14001' => '二维码加logo失败',
        '14002' => '修改用户二维码路径有误',
        '14003' => '生成分享图片失败',
        '14004' => '保存生成分享图片失败',
        '14005' => '分享图片失败',
        '14006' => '分享图片成功',
        '14007' => '分享内容id错误',


        /********上传图片返回信息************/
        '20000' => '上传内容为空',
        '20001' => '上传失败',


        /********工单操作****************/
        '30000' => '确认安装失败',
        '30001' => '用户类型不对',
        '30002' => '派单失败',
        '30003' => '已派单',


        /********智能锁操作****************/
        '40000' => '设备名不能为空',
        '40001' => '设备号不能为空',
        '40002' => '密码不能为空',
        '40003' => '添加失败',
        '40004' => '锁密码固定为6位',
        '40005' => '分享失败',
        '40006' => '已分享过',
        '40007' => '锁已添加过',
        '40008' => '失效时间必需大于生效时间',
        '40009' => '开锁失败',
        '40010' => '不可以分享给自己',

        /********门铃操作****************/
        '50000' => '门铃添加失败',
        '50001' => '门铃已添加过',


        /********优惠券返回信息************/
        '60000' => '已经发放过优惠券',
        '60001' => '发放优惠券失败',
        '60002' => '优惠券不存在',
        '60003' => '超过优惠券发放数量',


        /********微信登录返回信息************/
        '70000' => '微信第三方数据不能为空',


        /********购物积分奖励返回信息************/
        '80000' => '积分规则为空',
        '80001' => '不是推荐人',
        '80002' => '积分不足',
        '80003' => '用户更新积分出错',
        '80004' => '积分申请提现失败',


        /********购物积分奖励返回信息************/
        '90000' => '订单为空',
        '90001' => '已经申请了退款',
        '90002' => '申请退款失败',
        '90003' => '订单还未付款，无法退款',
        '90004' => '订单还未申请退款',


        /********发送短信返回信息************/
        '110000' => '短信发送太频繁，请稍后再试',
        '110001' => '发送失败',
        '110002' => '验证码不匹配',

    ],
);